{"Are you a Luddy Student?": "Luddy or not?", "What is the name of your home department?": "other_department ", "If you are Luddy student, what is your home department/program?": "luddy_department ", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - People in the Luddy School notice when I am good at something": "sense of belonging _1", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - Faculty and staff in the Luddy School value my opinions": "sense of belonging _2", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - Other students in the Luddy School take my opinions seriously": "sense of belonging _3", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - Most faculty and staff in the Luddy School are interested in me.": "sense of belonging _4", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - There is at least one instructor or other faculty or staff member in the the Luddy School I can talk to if I have a problem.": "sense of belonging _5", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - People in the Luddy School are friendly to me.": "sense of belonging _6", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - Students in the Luddy School help each other to succeed.": "sense of belonging _7", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - I am treated with as much respect as other students.": "sense of belonging _8", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - I have a good relationship with other students in the Luddy School.": "sense of belonging _9", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - I can really be myself in the Luddy School.": "sense of belonging _10", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - The faculty and staff in the Luddy School  respect me.": "sense of belonging _11", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - People in the Luddy School know I can do good work.": "sense of belonging _12", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - The instructors in the Luddy School give me compliments when I do something well.": "sense of belonging _13", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - I feel proud of belonging to the Luddy School.": "sense of belonging _14", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - Other students in the Luddy School  like me the way I am.": "sense of belonging _15", "Please rate your agreement with the following statements based on how you feel about the Luddy School. - Faculty and staff in the Luddy School really want me to succeed.": "sense of belonging _16", "How many years have you been at IU?": "Q19", "I can master the content of the Luddy courses I am taking this semester": "Q12", "I could master the content of even the most challenging Luddy courses if I try": "Q13", "I can do a good job on all of my Luddy courses if I do not give up": "Q15", "I can do an excellent job on Luddy course-related problems and tasks assigned this semester": "Q16", "I can learn the content taught my Luddy courses": "Q17", "I can earn a good grade in the Luddy courses that I am taking this semester": "Q14", "For what course are you being asked to fill out this survey?": "Q6", "How do you describe yourself? - Selected Choice": "Q10", "How do you describe yourself? - Prefer to self-describe - Text": "Q10_4_TEXT", "Choose one or more races that you consider yourself to be": "Q11", "Are you of Spanish, Hispanic, or Latino origin?": "Q12.1", "Are you a domestic or international student?": "nationality"}